app/controllers/clinics_controller.rb

SELECT  "clinics".* FROM "clinics" WHERE ((LOWER(clinics.name) LIKE 'aguascalientes%' OR LOWER(clinics.state) LIKE 'aguascalientes%' OR LOWER(clinics.municipality) LIKE 'aguascalientes%'))  ORDER BY "clinics"."id" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "clinics" WHERE (state LIKE '%AGUASCALIENTES%') AND ((LOWER(clinics.name) LIKE 'uneme%' OR LOWER(clinics.state) LIKE 'uneme%' OR LOWER(clinics.municipality) LIKE 'uneme%'))
---
  def index
    #@clinics = Clinic.all
    puts "Inside index controller method"
    puts "About to create filterrific controller"
    @filterrific = initialize_filterrific(
    Clinic,
    params[:filterrific],
    select_options: {
        by_state: Clinic.options_for_select_state,
        by_municipality: Clinic.options_for_select_municipality
      },
      default_filter_params: {},
    ) or return
    puts "Initialized filterrific properly"
    @clinics = @filterrific.find.page(params[:page])
    puts "Found all of the clinics"
    puts "Clinics length: #{@clinics.length}"

INSERT INTO "clinics" ("name", "phone_number", "email", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    #byebug
    is_valid = check_params(-1)

    if is_valid == "None"
        @clinic = Clinic.new(clinic_params)
    else
        #Sets the flash[:warning] value to the rendered error message
        flash[:warning] = is_valid
        redirect_to new_clinic_path and return
    end

    respond_to do |format|
      if @clinic.save

UPDATE "clinics" SET "name" = ?, "phone_number" = ?, "updated_at" = ? WHERE "clinics"."id" = ?  [["name", ""], ["phone_number", "New Clinic"], ["updated_at", "2016-03-10 18:22:24.557668"], ["id", 3]]
---
  def update
    is_valid = check_params(@clinic.id)
    update =  @clinic.update(clinic_params)

SELECT  "clinics".* FROM "clinics" WHERE "clinics"."id" = ? LIMIT 1  [["id", 1]]
---
  def confirm
      @clinic = Clinic.find_by_id(params[:id])

DELETE FROM "clinics" WHERE "clinics"."id" = ?  [["id", 1]]
---
  def destroy
    @clinic.destroy

SELECT  "clinics".* FROM "clinics" WHERE "clinics"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_clinic
      @clinic = Clinic.find(params[:id])