app/controllers/schedules_controller.rb

SELECT "schedules".* FROM "schedules"
---
  def index

    if current_user != nil
        @schedules = Schedule.all

INSERT INTO "schedules" ("treatment_options", "start_time", "end_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    if params[:schedule]["start_time(1i)"] > params[:schedule]["end_time(1i)"]
        redirect_to "/find"
        return
    end

    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save