app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "ahrens.danielj@berkeley.edu"], ["admin", "f"], ["updated_at", "2016-03-10 09:42:07.641877"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
---
  def login
      @user = User.where(email: params[:email]).take

SELECT "users".* FROM "users" WHERE "users"."email" = ?  [["email", "dahrens@berkeley.edu"]]
---
  def signin
      @user = User.where(email: params[:email]).take

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_user
      if not params[:id]
        @user = User.find(params[:id])